cpu_affinity/fio_logs/rfuse_base/randread_128k_1.log
randread: (g=0): rw=randread, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=psync, iodepth=1
fio-3.16
Starting 1 process

randread: (groupid=0, jobs=1): err= 0: pid=23303: Thu Oct  9 01:56:52 2025
  read: IOPS=2728, BW=341MiB/s (358MB/s)(1024MiB/3002msec)
    clat (usec): min=9, max=4352, avg=365.20, stdev=255.33
     lat (usec): min=9, max=4352, avg=365.35, stdev=255.32
    clat percentiles (usec):
     |  1.00th=[   29],  5.00th=[   38], 10.00th=[   39], 20.00th=[   52],
     | 30.00th=[   55], 40.00th=[  424], 50.00th=[  510], 60.00th=[  537],
     | 70.00th=[  562], 80.00th=[  586], 90.00th=[  619], 95.00th=[  635],
     | 99.00th=[  701], 99.50th=[  725], 99.90th=[  766], 99.95th=[ 1450],
     | 99.99th=[ 4359]
   bw (  KiB/s): min=241408, max=467200, per=99.93%, avg=349056.00, stdev=88363.21, samples=6
   iops        : min= 1886, max= 3650, avg=2727.00, stdev=690.34, samples=6
  lat (usec)   : 10=0.01%, 20=0.62%, 50=18.49%, 100=17.74%, 250=0.57%
  lat (usec)   : 500=9.20%, 750=53.23%, 1000=0.04%
  lat (msec)   : 2=0.07%, 10=0.01%
  cpu          : usr=0.50%, sys=24.53%, ctx=5452, majf=0, minf=41
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=8192,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=341MiB/s (358MB/s), 341MiB/s-341MiB/s (358MB/s-358MB/s), io=1024MiB (1074MB), run=3002-3002msec