cpu_affinity/fio_logs/rfuse_base/randread_4k_4.log
randread: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.16
Starting 4 processes

randread: (groupid=0, jobs=4): err= 0: pid=604342: Thu Oct  9 13:45:07 2025
  read: IOPS=46.9k, BW=183MiB/s (192MB/s)(4096MiB/22373msec)
    clat (nsec): min=371, max=10003k, avg=81853.17, stdev=122590.94
     lat (nsec): min=387, max=10003k, avg=81968.29, stdev=122594.34
    clat percentiles (nsec):
     |  1.00th=[   1448],  5.00th=[   2224], 10.00th=[   2448],
     | 20.00th=[   2928], 30.00th=[   3792], 40.00th=[  43264],
     | 50.00th=[ 112128], 60.00th=[ 120320], 70.00th=[ 126464],
     | 80.00th=[ 134144], 90.00th=[ 146432], 95.00th=[ 168960],
     | 99.00th=[ 216064], 99.50th=[ 238592], 99.90th=[ 325632],
     | 99.95th=[1155072], 99.99th=[6717440]
   bw (  KiB/s): min=121136, max=356817, per=100.00%, avg=189401.11, stdev=15263.02, samples=170
   iops        : min=30284, max=89204, avg=47350.23, stdev=3815.76, samples=170
  lat (nsec)   : 500=0.01%, 750=0.06%, 1000=0.30%
  lat (usec)   : 2=1.57%, 4=29.28%, 10=4.78%, 20=0.90%, 50=4.38%
  lat (usec)   : 100=3.86%, 250=54.52%, 500=0.28%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.02%, 4=0.01%, 10=0.02%, 20=0.01%
  cpu          : usr=2.86%, sys=17.29%, ctx=667570, majf=0, minf=37
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1048576,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=183MiB/s (192MB/s), 183MiB/s-183MiB/s (192MB/s-192MB/s), io=4096MiB (4295MB), run=22373-22373msec