cpu_affinity/fio_logs/rfuse_base/read_4k_16.log
read: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.16
Starting 16 processes

read: (groupid=0, jobs=16): err= 0: pid=578228: Thu Oct  9 13:36:42 2025
  read: IOPS=550k, BW=2149MiB/s (2254MB/s)(16.0GiB/7623msec)
    clat (nsec): min=187, max=14384k, avg=28305.96, stdev=263860.08
     lat (nsec): min=200, max=14384k, avg=28375.64, stdev=263859.98
    clat percentiles (nsec):
     |  1.00th=[    398],  5.00th=[    676], 10.00th=[    972],
     | 20.00th=[   1272], 30.00th=[   1416], 40.00th=[   1528],
     | 50.00th=[   1656], 60.00th=[   1768], 70.00th=[   1896],
     | 80.00th=[   2064], 90.00th=[   2416], 95.00th=[   2736],
     | 99.00th=[ 978944], 99.50th=[2441216], 99.90th=[3489792],
     | 99.95th=[3784704], 99.99th=[4620288]
   bw (  MiB/s): min= 1880, max= 2510, per=99.99%, avg=2149.18, stdev=10.69, samples=238
   iops        : min=481482, max=642748, avg=550189.08, stdev=2736.84, samples=238
  lat (nsec)   : 250=0.02%, 500=2.74%, 750=3.32%, 1000=4.45%
  lat (usec)   : 2=66.42%, 4=20.85%, 10=0.51%, 20=0.09%, 50=0.05%
  lat (usec)   : 100=0.07%, 250=0.23%, 500=0.09%, 750=0.09%, 1000=0.08%
  lat (msec)   : 2=0.30%, 4=0.66%, 10=0.03%, 20=0.01%
  cpu          : usr=3.05%, sys=12.51%, ctx=54298, majf=0, minf=191
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=4194304,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=2149MiB/s (2254MB/s), 2149MiB/s-2149MiB/s (2254MB/s-2254MB/s), io=16.0GiB (17.2GB), run=7623-7623msec