cpu_affinity/fio_logs/rfuse_base/write_128k_16.log
write: (g=0): rw=write, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=psync, iodepth=1
...
fio-3.16
Starting 16 processes

write: (groupid=0, jobs=16): err= 0: pid=21277: Thu Oct  9 01:52:16 2025
  write: IOPS=17.0k, BW=2126MiB/s (2229MB/s)(16.0GiB/7707msec); 0 zone resets
    clat (usec): min=50, max=75342, avg=737.26, stdev=929.04
     lat (usec): min=51, max=75343, avg=738.32, stdev=929.17
    clat percentiles (usec):
     |  1.00th=[   75],  5.00th=[  237], 10.00th=[  453], 20.00th=[  506],
     | 30.00th=[  545], 40.00th=[  635], 50.00th=[  734], 60.00th=[  766],
     | 70.00th=[  799], 80.00th=[  840], 90.00th=[  898], 95.00th=[  963],
     | 99.00th=[ 2606], 99.50th=[ 7963], 99.90th=[ 8094], 99.95th=[ 8094],
     | 99.99th=[59507]
   bw (  MiB/s): min= 2199, max= 3543, per=100.00%, avg=2656.44, stdev=25.61, samples=186
   iops        : min=17594, max=28350, avg=21250.70, stdev=204.90, samples=186
  lat (usec)   : 100=2.59%, 250=2.58%, 500=13.15%, 750=35.98%, 1000=42.24%
  lat (msec)   : 2=2.34%, 4=0.34%, 10=0.75%, 20=0.01%, 100=0.01%
  cpu          : usr=0.21%, sys=77.58%, ctx=292787, majf=0, minf=183
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,131072,0,16 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=2126MiB/s (2229MB/s), 2126MiB/s-2126MiB/s (2229MB/s-2229MB/s), io=16.0GiB (17.2GB), run=7707-7707msec