cpu_affinity/fio_logs/rfuse_base/write_4k_32.log
write: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.16
Starting 32 processes

write: (groupid=0, jobs=32): err= 0: pid=592408: Thu Oct  9 13:41:28 2025
  write: IOPS=185k, BW=724MiB/s (759MB/s)(32.0GiB/45274msec); 0 zone resets
    clat (usec): min=3, max=90424, avg=165.07, stdev=388.70
     lat (usec): min=3, max=90424, avg=165.12, stdev=388.73
    clat percentiles (usec):
     |  1.00th=[   20],  5.00th=[   73], 10.00th=[   85], 20.00th=[   89],
     | 30.00th=[   92], 40.00th=[   96], 50.00th=[  111], 60.00th=[  133],
     | 70.00th=[  143], 80.00th=[  202], 90.00th=[  306], 95.00th=[  363],
     | 99.00th=[  510], 99.50th=[  619], 99.90th=[ 7832], 99.95th=[10814],
     | 99.99th=[12125]
   bw (  KiB/s): min=243527, max=1915009, per=100.00%, avg=764725.07, stdev=9011.68, samples=2755
   iops        : min=60880, max=478749, avg=191180.35, stdev=2252.91, samples=2755
  lat (usec)   : 4=0.01%, 10=0.32%, 20=0.77%, 50=2.06%, 100=42.03%
  lat (usec)   : 250=35.60%, 500=18.16%, 750=0.74%, 1000=0.13%
  lat (msec)   : 2=0.06%, 4=0.01%, 10=0.09%, 20=0.05%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.34%, sys=72.29%, ctx=614831705, majf=0, minf=446
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8388608,0,32 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=724MiB/s (759MB/s), 724MiB/s-724MiB/s (759MB/s-759MB/s), io=32.0GiB (34.4GB), run=45274-45274msec